# 常用命令

***

## 文件命令

* 命令格式

> 命令 [-选项] [参数]
>
> 选项有两种格式，-a和—all；两者是一样的，一个简写方便。

* ls命令

  显示目录下的文件

  英文：list

  格式

  > ls [-options] [filename|directory]

  常用options

  ​	-a ：显示所有文件，包括隐藏文件（默认不显示，linux中隐藏文件都是文件名中一点号开头的文件）

  ​    -l ： 显示文件的详细信息，默认只显示文件名

  ​	-d : 查看目录属性，默认如果参数给定的是目录，则显示目录下的所有文件。

  ​    -h ： 配合-l使用，文件大小以合适的方式展示。默认是以b为单位展示，-h选项能使得以更直观的k m g来显示

  ​	-i： 查看文件的inode节点

  ​	-s: 按照文件名排序

  ​    -S：按照文件大小排序

     -r ：反序输出

  ​	—color=auto:渲染颜色，将auto换成none关闭颜色

  例如：

  ```shell
  ls -lh
  -rwxr-xr-x. 1 root root  254 May 12 17:50 server.sh
  #PS：文件权限 | 引用数 | 所属用户 | 所属分组 | 文件大小 | 文件修改时间 | 文件名
  ```

  常用颜色极其意义：

  ```shell
  白色：表示普通文件
  蓝色：表示目录
  绿色：表示可执行文件
  红色：表示压缩文件
  浅蓝色：链接文件
  红色闪烁：表示链接的文件有问题
  黄色：表示设备文件
  灰色：表示其他文件
  ```

  

* mkdir
  创建文件目录。
	英文名： make directory
	格式
	
	> mkdir [-options] directoryName
	常用options
	
 * -p 递归创建，如果指定目录中有不存在的目录，自动创建。如果不指定该选项，不存在目录时会提示错误
  
* cd
	切换工作目录
	英文名： change directory
	格式
	> cd 文件目录
	> cd .. //返回上级目录
	> cd ~ //切换到用户home目录。
	PS： 没有选项
	
* pwd
	打印当前工作目录
  英文名: print working directory
  格式
> pwd

* rmdir 
  删除空目录
  英文名： remove directory
  格式
> rmdir 目录 //只能删除空目录

* cp
	复制文件或目录
	英文名: copy
	格式
	
	> cp -rp 源文件或目录  目标文件或目录
	选项：
	
    * -r：复制目录
    * -p：保留文件属性
  	PS； 源文件和目录可以指定多个。
  		 目标文件如果指定文件名，可以copy同时修改名。目标是目录，则使用原来的名称
  
* mv
	文件和目录剪切和重命名
	英文名： move 
	格式
	
	> mv 原文件或目录  目标文件或目录
	
* rm
	删除文件或目录
	英文名： remove
	格式
	
	> rm -rf 文件名或目录
	常用选项：
		
		* -r：删除目录
	
	* -f：强制删除。--force
	
* touch
	创建空文件
	格式
	
	> touch [文件名...] //可以创建多个，文件名可以用双引号包裹，特别是文件名带空格时。 	
* cat
	查看文件内容
	语法：
	> cat [options] 文件名
	> 常用选项：
	>
	>   * -n 显示行号
	>   * -A 查看文件中的隐藏字符，如：换行符
	
* tac
	cat的反向显示，这里的反向指的是以行为单位从末行向首行依次输出。
	语法
	
	> tac [-options] 文件名
	
* more
	文件分页查看命令
	语法：
	> more 文件名
	>  空格或f： 翻页
	>   enter： 换行
	>   q或Q： 退出
	>   b或B： 上一页
	
	ps：这个命令适合文件内容特别长的时候使用
	
* less
	文件分页查看
	语法：
	> less 文件名
	>  空格或f： 翻页
	>   enter： 换行
	>   q或Q： 退出
	>   b或B： 上一页
	>   /关键字 ：搜索
	>   	n： 下一个匹配
	>   	p： 上一个匹配

* head
	查看文件的前几行
	语法：
	
	> head [-n 数字] 文件名
	常用选项：
	
		* -n： 显示前多少行，默认不指定的话显示前十行
	
* tail
	查看文件的后几行，这个查看日志的时候特别有用
	语法：
	
	> tail [-nf] 文件名
	常用选项：
		
		* -n 显示后多少行，不指定默认十行
	
	* -f 动态显示末尾行，如果文件中有添加行，自动显示
	
* ln
  创建链接文件。链接分为软链接和硬链接
  英文：link
  格式：
  
  > ln [-s] 原文件 目标文件
  常用选项：
  	* -s 创建软链接
  > 软链接文件类似于windows下的快捷方式，只是一种对原文件的指向文件。
	> 硬链接则是一个完全原文件的副本，类似于cp -p产生的效果。但与之不同的是，硬链接能和原文件同步更新。（猜测实际文件路径不一样，实际指向的文件存储地址是一样的）；查看是否是硬链接文件，通过ls -i可以查看。硬链接不能跨分区创建（原因还是inode节点问题）
	
* clear
	清屏
	格式
	
  > clear //或者使用ctrl+l键
  

## 权限管理
* chmod
	文件权限修改，只有root和文件所有者能修改文件的权限
	英文： change the permission mode of a file
	格式
	> chmod -R  [{ugoa}{+-=}{rwx}][文件或目录]
	> //这种形式可以做多个授权，授权之间用逗号隔开。例如： chmod g+wx,o-w file.test
	> chmod -R [mode=421][文件或目录]
	> 
常用选项：
	* -R 递归修改子文件和子目录
权限对文件的影响：
> 文件
> r： 文件的浏览，如cat，tac ，more，less等
> w： 文件的创建和删除，如： vi， vim修改后保存等
> x： 脚本或命令文件的执行
> 目录
> r： 浏览目录中文件和子目录集合。如：ls
> w： 文件和目录的创建和删除，如：touch，mkdir，rmdir，rm
> x： 进入目录，如：cd
> 

* chown 
	修改文件或目录的所有者
	使用者：root
	英文： change owner
	格式：
	
> chown [用户][文件或目录]

* chgrp
	修改文件或目录的所属分组
	使用者：root
	英文： change group
	格式：
	> chgrp [分组] [文件或目录]
	> 

* umask
	查看和设置创建文件和目录的默认权限
	英文： the user file-creation mask
	格式：
	
	> umask [-S]
	常用选项：
  	* -S：以RWX的形式显示
  PS：默认创建的文件是不具有执行权限的。如果不加选项-S时，显示的是数字，表示默认不具有的权限，所以实际权限和777做减法运算即可。

PS：若要长期修改umask的值，可以把它写进/etc/profile或~/.profile或~/.bash_profile中

## 文件搜索

windows下推荐搜索软件：everything

### find

文件搜索
格式：
> find [搜索范围] [匹配条件]
常用选项：
 * -name 根据文件名查找。
 * -iname 根据文件名查找，不区分大小写
 * -size 根据文件大小查找。 +n 大于n -n 小于n =n 正好n大小。 n是数据块的数量。所以一般需要计算（数据块大小是512字节）。比如：100M大小 = 100*1024*1024/512 = 204800
 * -user 根据文件所有者查询
 * -amin 访问时间access
 * -cmin 文件属性change，文件权限等属性修改时间
 * -mmin 文件内容修改时间modify
 * -a 表示and，就是前后条件都需要满足
 * -o 表示or，前后条件有一个满足即可
 * -type 按照文件类型查找。f文件，l链接，d目录
 * -executes/-ok 查找完成后，执行指定操作。例如：find /etc init -executes ls -l {} \; 其中{}表示上面查找的结果
 * -inum 根据inode查找
匹配条件：
 * 支持通配符。
 * 匹配条件区分大小写

### locate
在文件资料库中查找
格式：
> locate [文件名]
常用选项：
  * -i 不区分大小写
PS：这种查找方式比find的命令要高效，但是新增加的文件需要通过命令`updatedb`后更新资料库后才能查询到。而且locate的资料库是无法收录tmp目录下的文件的。

### which
查找命令所在的路径以及别名
格式：
> which command

### whereis
查找命令所在的路径以及它的帮助文档
格式:
> whereis command
> 

### grep
在文件中所有指定的内容并输出
格式：
> grep [-option] 指定字符串 文件
> 常用选项：
> * -i 不区分大小写
> * -v 排除指定字符串
> * -E 使用正则表达式
> 指定字符串支持正则表达式。
> * —color=auto 将查询的指定字符串用颜色标识

### man
查看命令帮助
格式：
> man command
man也可以查看配置文件的信息。例如：
> man services
> man对应的帮助有 1 命令， 5配置文件。所以也可以是：
> man 5 services

### whatis 
查看命令

### apropos
查看配置文件

### help
获得shell内置命令的帮助
> help command 

### info
查看帮助

## 用户管理
### useradd
添加新用户
格式
> useradd 用户名

### password
设置和修改用户密码
格式
> password 
root可以更改所有人的密码，否则只能自己修改自己的密码

### who
查看登录用户信息
格式
> who
> root     pts/1        2019-05-17 01:28 (192.168.254.104)
> 登录用户名 登录终端（tty本地终端 pts是远程终端）  登录时间 ip地址（缺省表示本地）

### w
查看登录用户的详细信息
格式：
> w
当前时间 运行时间           两个用户  负载均衡：可以判断服务器负载情况
01:33:14 up 4 days,  8:32,  2 users,  load average: 0.00, 0.01, 0.05 
                                           空闲时间
USER     TTY      FROM             LOGIN@   IDLE   JCPU   PCPU WHAT
root     pts/0    192.168.254.178  16:36    7:30m  0.05s  0.04s redis-cli
root     pts/1    192.168.254.104  01:28    2.00s  0.02s  0.01s w
PS:查看主机运行时间，可以通过命令uptime。

## 文件解压缩
> 文件压缩格式
> .gz
### gzip
压缩文件
格式：
> gzip [文件]
> 压缩后文件格式 .gz
常用选项：
  * -d 解压缩文件。等同于下面介绍的gunzip命令 
PS:
1.gzip只能压缩文件，不能压缩目录,如果要压缩目录，先用tar命令打包后压缩
2.压缩后不保留原文件。

### gunzip
解压缩文件
格式
> gunzip [文件]

### tar
用法1:压缩文件或目录
格式
> tar -cvf [打包文件] [目标文件]
> -c 打包
> -v 显示详细信息
> -f 指定文件名
> -z 压缩zip格式包
> -j 压缩bz2格式包
> -p 和cp命令一样可以保留文件原来的属性

用法2:解压缩文件或目录
格式：
> tar -zxvf 压缩文件  //选项的顺序很重要。尤其z和x的，表示先解压后解包
>

常用选项：

 * -x: 解包
 * -v：显示详细信息
 * -f: 指定解压文件
 * -z: 解压缩zip格式
 * -j: 解压缩bz2格式
例如：`tar -zxvf test.tar.gz`

用法3:查看压缩文件内容
格式：
> tar -ztvf 压缩文件

### zip
压缩文件或目录
格式：

> zip [-r] [压缩后文件名] [文件或目录]
> 常用选项：
>
>   * -r: 压缩目录
> 和gzip相比优势
> * 原文件会保存
> * 支持压缩目录

### unzip
解压缩文件或目录
格式
> unzip [压缩后的文件]

### bzip2
压缩文件
格式
> bzip2 [-k] [文件]
常用选项：
 * -k 压缩文件后，保留原文件

### bunzip 
解压缩bz2文件
格式
> bunzip [bz2压缩文件]

## 网络命令
### write 
给用户发送消息，以CTRL+D保存结束（CTRL+D输入结束符EOF）
格式：

> write <用户名>

### wall
发送广播信息
英文：write all
格式：
> wall <消息内容>

### ping
测试网络的连通性
格式

> ping <ip>

常用选项：
 * -c 指定ping的次数，否则无限ping

### ifconfig
查看和设置网卡信息
格式

> ifconfig [[网卡名称] [ip地址]] 

### mail
查看和发送电子邮件
格式：

> mail [用户名]

ps: 不是实际的电子邮箱，更类似于离线信息


### last
列出目前和过去登入系统的用户信息，以及系统启动日志
格式

> last

### lastlog
列出所有用户的最后登录情况
格式

> lastlog [-option]

常用选项：
 * -u 查看指定用户;格式：-u  <用户>

### traceroute
显示数据包到主机间的路径
格式：

> traceroute

例如： traceroute www.baidu.com

### netstat
显示网络相关信息
英文： net state
格式：
> netstat [-option]

常用选项：
  * -t :tcp协议
  * -u : udp协议
  * -l : 监听
  * -r : 路由
  * -n : 显示ip和端口
例如：
```
 netstat -tlun 查看本机监听的端口
 netstat -an 查看本机所有网络连接
 netstat -rn  查看本季路由表
```



### setup

图形化界面配置网络(永久生效)
格式：

> setup

### mount
挂载命令
格式：

> mount [-t 文件系统] 挂载设备或文件 挂载点

## 关机命令
### shutdown
关机
格式:
> shutdown [-option] 

常用选项：
  * -c 取消前一个关机命令
  * -h 关机
  * -r 重启
例如：
```
shutdown -h now/8:30/5 #立刻关机/8:30关机/5分钟后关机 
shutdown -r now/8:30/5 #立刻重启/8:30重启/5分钟后重启 
```

### reboot 重启
### init 6 重启
### half 关机
### poweroff 关机
### init 0 关机
### init 系统运行级别 
  * 0:关机
  * 1:单用户
  * 2:不完全多用户，不含nfs服务
  * 3:完全多用户
  * 4: 未分配
  * 5: 图形界面
  * 6:重启
PS： 可以查看`cat /etc/inittab`查看运行级别的意义。不过高版本的linux不再使用这种命令
### runlevel 
查看当前运行级别。
格式：
> run level
>`N 3`,第一个字符表示上个级别（N表示空），第二个是当前级别是3
> 

### logout
退出登录